{
  "projects": [
    {
      "title": "CirrusStore",
      "description": "A cloud-based storage system built on AWS S3. Once configured, scans target folder and all subfolders recursively. Can exclude specific files and folders, similar to .gitignore. Tracks changes by file size and SHA-256 hash. Compresses files with .lz4 before uploading.",
      "imgSrc": "cirrus-store.png",
      "link": "https://github.com/scotteratigan/cirrus-store"
    },
    {
      "title": "Virtually Vested",
      "description": "A Full Stack React App that simulates stock trades. Quotes and other info is pulled in real-time via the AlphaVantage and IEXCloud APIs. Utilizes MongoDB, Auth0, query caching, and more. (Hosted on Heroku - allow a few seconds for instance to load.)",
      "imgSrc": "virtuallyvested.png",
      "link": "https://virtuallyvested.herokuapp.com/"
    },
    {
      "title": "ReactCell",
      "description": "React FreeCell game. Click to select a card, click again to move it. Double-click a card to stack it on a foundation automatically.",
      "imgSrc": "reactcell.png",
      "link": "https://scotteratigan.github.io/reactcell"
    },
    {
      "title": "Warriors Memory Game",
      "description": "'Pass' the ball to a player by clicking on him. Win the game by passing to all players exactly once. But keep track of who you've passed to, because they're constantly moving around on the 'court'.",
      "imgSrc": "memorygame.png",
      "link": "https://scotteratigan.github.io/click-game/"
    },
    {
      "title": "NPR Scraper & Notater",
      "description": "Read and take notes on top stories. A webscraping app using Express, Mongoose, Cheerio, Axios, Bootstrap, Morgan, Chai, and more.  (Hosted on Heroku - allow a few seconds for instance to load.)",
      "imgSrc": "nprscraper.png",
      "link": "https://derivative-daily.herokuapp.com/"
    },
    {
      "title": "QR Code Generator",
      "description": "QR Codes of all types!  (Hosted on Heroku - allow a few seconds for instance to load.)",
      "imgSrc": "qr.png",
      "link": "https://scotts-qr-code-generator.herokuapp.com/"
    },
    {
      "title": "Google Book Buddy",
      "description": "A full-stack React app utilizing the Google Books API.  (Hosted on Heroku - allow a few seconds for instance to load.)",
      "imgSrc": "googlebookbuddy.png",
      "link": "https://scotts-google-book-search.herokuapp.com/"
    },
    {
      "title": "Bike Shepherd",
      "description": "Help protect yourself from bike theft. A collaborative project using Express, Passport, bCrypt, JawsDB, Sequelize, Handlebars and more.  (Hosted on Heroku - allow a few seconds for instance to load.)",
      "imgSrc": "bikeshepherd.png",
      "link": "https://bike-shepherd.herokuapp.com/"
    },
    {
      "title": "Friend Finder",
      "description": "A full-stack survey app to match you to the person with the most similar interests.  (Hosted on Heroku - allow a few seconds for instance to load.)",
      "imgSrc": "friendfinder.png",
      "link": "https://scotts-friend-finder.herokuapp.com/"
    },
    {
      "title": "Node SQL Storefront",
      "description": "A console-based storefront with customer and manager access, with full CRUD support. Manager view utilizes promises extensively.",
      "imgSrc": "nodesqlzon.png",
      "link": "https://github.com/scotteratigan/nodesqlzon/blob/master/README.md"
    },
    {
      "title": "LIRI Bot",
      "description": "Uses multiple APIs to request and display data, and log to file. Also downloads and plays Spotify song previews.",
      "imgSrc": "liri.png",
      "link": "https://github.com/scotteratigan/liri/blob/master/README.md"
    },
    {
      "title": "Enthusiastic Gifs in a Giffy",
      "description": "Uses jQuery and the Giffy API to generate still images that can be animated by clicking. Captions display on hover. Fetches large or small gifs based on the screen size, for performance. This one is fun to play with!",
      "imgSrc": "gifsinajiffy.png",
      "link": "https://scotteratigan.github.io/GifsinaJiffy/"
    },
    {
      "title": "Marvelous Meme Creation App",
      "description": "A colloaborative project. Uses the Marvel API to retrieve images, Firebase to store and retrieve image SRC and caption, and the browser to \"speak\" the meme.'",
      "imgSrc": "marvelousmemes.png",
      "link": "https://rhoang57.github.io/Team7/"
    },
    {
      "title": "Yo Dawg JavaScript Trivia",
      "description": "A JavaScript trivia game, written in JavaScript. Naturally, Xzibit themed. Uses jQuery, complex objects, this, and setTimeout.",
      "imgSrc": "javascripttrivia.png",
      "link": "https://scotteratigan.github.io/TriviaGame/"
    },
    {
      "title": "Fantasy RPG",
      "description": "Objects, object constructors, dynamic HTML elements, and more. Every game is potentially winnable, in the correct order.",
      "imgSrc": "rpg.png",
      "link": "https://scotteratigan.github.io/unit-4-game/"
    },
    {
      "title": "Hipster Hangman",
      "description": "A modern twist on the classic game. Explores keyboard/mouse events, sound, and dynamically updated HTML content.",
      "imgSrc": "hangman.png",
      "link": "https://scotteratigan.github.io/WordGuessGame/"
    }
  ]
}
